In [4]:
# 데이터 pdf3 데이터 추출 및 변환 (특정 문자 삭제)
text = "apple,"
result = text.rstrip(",")
print(result)

apple

In [5]:
text = "banana,,"
result = text.rstrip(",")
print(result)

banana

In [7]:
text = ",orange,pear"
result = text.lstrip(",")
print(result)
# 맨 왼쪽의 쉼표가 사라지고 가운데의 쉼표만 남는다

orange,pear

In [9]:
text = ", ,, ,,orange,,,"
result = text.strip(",")
print(result)

 ,, ,,orange

In [11]:
text = ",,,,,orange,,,"
result = text.strip(",")
print(result)
# 이전과 다르게 전부 다 지워진다

orange

In [18]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    '문항1': ['1','2','4,','2'],
    '문항2': ['2', '2', '3', ',2']
})

df['문항1']= df['문항1'].str.rstrip(",")
df['문항2']= df['문항2'].str.lstrip(",")

print(df)

  문항1 문항2
0   1   2
1   2   2
2   4   3
3   2   2

In [19]:
df=pd.read_csv("C:\\Users\\PC502\\Desktop\\health (2).csv")
df

  다이어트경험_답변1 다이어트경험_답변2 다이어트경험_답변3 다이어트경험_답변4
0         운동        NaN        NaN        NaN
1        NaN         운동        NaN        NaN
2       식이조절        NaN         단식        NaN
3        NaN         단식        NaN         운동
4        NaN        NaN       식이조절        NaN
5         단식        NaN        NaN         운동
6        NaN       식이조절        NaN         단식
7        NaN        NaN        NaN        NaN
8         운동        NaN         단식       식이조절
9        NaN         운동        NaN         단식

In [20]:
diet_columns = ['다이어트경험_답변1', '다이어트경험_답변2', '다이어트경험_답변3', '다이어트경험_답변4']
df[diet_columns] = df[diet_columns].replace(r'^\s*$', np.nan,regex=True)
                
# 행단위로 작업을 수행함 : bfill(axis=1)
# 채운결과에서 각행의 첫번째 값을 가지고 온다는 의미 → iloc[:, 0]
df['묶기'] = df[diet_columns].bfill(axis=1).iloc[:, 0]

In [21]:
df

  다이어트경험_답변1 다이어트경험_답변2 다이어트경험_답변3 다이어트경험_답변4    묶기
0         운동        NaN        NaN        NaN    운동
1        NaN         운동        NaN        NaN    운동
2       식이조절        NaN         단식        NaN  식이조절
3        NaN         단식        NaN         운동    단식
4        NaN        NaN       식이조절        NaN  식이조절
5         단식        NaN        NaN         운동    단식
6        NaN       식이조절        NaN         단식  식이조절
7        NaN        NaN        NaN        NaN   NaN
8         운동        NaN         단식       식이조절    운동
9        NaN         운동        NaN         단식    운동

In [24]:
# stack() 행의 값들을 차례대로 줄지어 쌓는것
# groupby() 줄지어 쌓은 것을 묶기, level=0은 맨 앞줄을 기준으로 묶기
# agg(list) 리스트로 만들기
# 분석가의 주관으로 진행되어야 하는 것이다.

df['하나의_항목'] = df[diet_columns].stack().groupby(level=0).agg(list)

In [25]:
df

  다이어트경험_답변1 다이어트경험_답변2 다이어트경험_답변3 다이어트경험_답변4    묶기          하나의_항목
0         운동        NaN        NaN        NaN    운동            [운동]
1        NaN         운동        NaN        NaN    운동            [운동]
2       식이조절        NaN         단식        NaN  식이조절      [식이조절, 단식]
3        NaN         단식        NaN         운동    단식        [단식, 운동]
4        NaN        NaN       식이조절        NaN  식이조절          [식이조절]
5         단식        NaN        NaN         운동    단식        [단식, 운동]
6        NaN       식이조절        NaN         단식  식이조절      [식이조절, 단식]
7        NaN        NaN        NaN        NaN   NaN             NaN
8         운동        NaN         단식       식이조절    운동  [운동, 단식, 식이조절]
9        NaN         운동        NaN         단식    운동        [운동, 단식]

In [38]:
# 날짜 및 시간 데이터 전처리
# 대부분의 데이터는 시간 데이터셋이 존재한다
#errors=“raise” 변환이 실패하면 오류가 발생함
#errors=“coerce” 변환이 실패하면 값이 “NaT”로 변환됨
#errors=“ignore” 변환이 실패하면 원본 데이터의 값을 반환함

data = {'date': ['202103151345', '20210315 1345', '0715', '07-15', '20210315','1']}
df = pd.DataFrame(data)
df

            date
0   202103151345
1  20210315 1345
2           0715
3          07-15
4       20210315
5              1

In [39]:
# Y는 년도 m,d 는 월,일 H,M은 시간 분이다
# 하나빼고 모두 NULL값으로 변환!
df['date']=pd.to_datetime(df['date'],format='%Y%m%d %H%M', errors='coerce')
df

                 date
0                 NaT
1 2021-03-15 13:45:00
2                 NaT
3                 NaT
4                 NaT
5                 NaT

In [41]:
# 데이터 다시 불러오기
data = {'date': ['202103151345', '20210315 1345', '0715', '07-15', '20210315','1']}
df = pd.DataFrame(data)

df['date']=pd.to_datetime(df['date'], format='%H%M', errors='coerce').dt.time
df

       date
0       NaT
1       NaT
2  07:15:00
3       NaT
4       NaT
5       NaT

In [45]:
# 데이터 다시 불러오기
data = {'date': ['202103151345', '20210315 1345', '0715', '07-15', '20210315','1']}
df = pd.DataFrame(data)

df['date']=pd.to_datetime(df['date'], format='%Y%m%d', errors='coerce')
df

        date
0        NaT
1        NaT
2        NaT
3        NaT
4 2021-03-15
5        NaT

In [46]:
data = {'hour':['1','2','12','22','11']}
df = pd.DataFrame(data)
df

  hour
0    1
1    2
2   12
3   22
4   11

In [48]:
pd.to_datetime(df['hour'], format='%H%M', errors='coerce').dt.time

0         NaT
1         NaT
2    01:02:00
3    02:02:00
4    01:01:00
Name: hour, dtype: object

In [53]:
# 시간에 대한 전처리를 할 수 있다.
df['hour']=df['hour'].str.rjust(4,fillchar='0')
df

   hour
0  0001
1  0002
2  0012
3  0022
4  0011

In [55]:
# 데이터 저장
# index=False 인덱스를 표시할지 않을지! 왠만해선 false로 지정
df.to_csv("new_program.csv", index=False, encoding='cp949')

NameError: name 'getcwd' is not defined